Repository: manaflow-ai/cmux
Catalog: cmux-tui/frontends/swift/CmuxLite/Sources/CmuxLiteCore/Resources/Localizable.xcstrings
Source language: en
Languages: ja

# connection.argument.invalid_url
source: Invalid WebSocket URL: %@
ja: 無効な WebSocket URL です: %@

# connection.argument.missing_value
source: Missing value for %@
ja: %@ の値がありません

# connection.argument.no_sockets
source: none
ja: なし

# connection.argument.selector_conflict
source: %@ cannot be combined with another transport selector
ja: %@ は別のトランスポート選択オプションと同時に指定できません

# connection.argument.session_empty
source: Session name must not be empty
ja: セッション名を空にすることはできません

# connection.argument.socket_discovery
source: Expected exactly one *.sock in %1$@, found %2$lld: %3$@; pass --socket <path>, --session <name>, or --url <ws://...>
ja: %1$@ に *.sock が 1 個必要ですが、%2$lld 個見つかりました: %3$@; --socket <path>、--session <name>、または --url <ws://...> を指定してください

# connection.argument.socket_empty
source: Socket path must not be empty
ja: ソケットパスを空にすることはできません

# connection.argument.token_requires_url
source: --token and --token-file require --url
ja: --token と --token-file には --url が必要です

# connection.argument.unknown_option
source: Unknown option: %@
ja: 不明なオプションです: %@

# frontend.error.pane_unavailable
source: Pane %lld is unavailable
ja: ペイン %lld は利用できません

# frontend.error.pane_size_unavailable
source: Pane %lld has no terminal grid yet
ja: ペイン %lld にはまだターミナルグリッドがありません

# frontend.error.render_protocol_required
source: Render mode requires cmux-tui protocol 7 or newer; server reported %@ protocol %lld
ja: レンダーモードには cmux-tui プロトコル 7 以降が必要です。サーバーは %@ プロトコル %lld を返しました

# frontend.error.surface_not_attached
source: Surface %lld is not attached
ja: サーフェス %lld はアタッチされていません

# frontend.error.surface_unavailable
source: Surface %lld is unavailable
ja: サーフェス %lld は利用できません

# frontend.error.tab_unavailable
source: Tab %1$lld in pane %2$lld is unavailable
ja: ペイン %2$lld のタブ %1$lld は利用できません

# transport.payload.inbound_not_utf8
source: Inbound JSON line is not UTF-8
ja: 受信した JSON 行は UTF-8 ではありません

# transport.payload.outbound_not_utf8
source: Outbound JSON is not UTF-8
ja: 送信する JSON は UTF-8 ではありません

# transport.state.already_connected
source: Already connected
ja: すでに接続されています

# transport.state.not_connected
source: Not connected
ja: 接続されていません

# transport.state.unix_closed
source: Unix socket closed
ja: Unix ソケットが閉じられました

# transport.state.unix_no_data
source: Unix socket receive completed without data
ja: Unix ソケットの受信がデータなしで完了しました
